app/controllers/blog_posts_controller.rb

  def index
     @blog_posts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

   def create
     logger.info("@@@@Create!")
     logger.info("@@@@PARAMS: #{params[:blog_post][:name]}")
     @blog_post = BlogPost.new(blog_post_params)
     respond_to do |format|
       if @blog_post.save
---
INSERT INTO "blog_posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Adding Content"], ["created_at", Sun, 26 Jan 2014 20:46:01 UTC +00:00], ["name", "Test 3 Again"], ["title", "TestBlog3"], ["updated_at", Sun, 26 Jan 2014 20:46:01 UTC +00:00]]

   def show
     logger.info("@@@@@SHOW!")
     @blog_post = BlogPost.find(params[:id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", "1"]]

   def edit
     logger.info("@@@@@Edit!")
     @blog_post = BlogPost.find(params[:id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", "3"]]

    def update
      @blog_post = BlogPost.find(params[:id])
      logger.info("@@@@@@UPDATE Name/CONTENT: #{@blog_post.name} / #{@blog_post.content}")
      respond_to do |format|
        if @blog_post.update_attributes(blog_post_params)
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "blog_posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "blog_posts"."id" = 3  [["title", "TestBlog3222"], ["content", ""], ["updated_at", Sun, 26 Jan 2014 20:37:52 UTC +00:00]]

    def destroy
      @blog_post = BlogPost.find(params[:id])
      @blog_post.destroy
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = ?  [["id", 3]]